#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sean-ahn/iac/runs/run-EUj11UU6eWmBQWCM

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
tfe_organization.sean-ahn: Refreshing state... [id=sean-ahn]
github_repository.blog-web: Refreshing state... [id=blog-web]
github_repository.iac: Refreshing state... [id=iac]
github_repository.gotzdatacheck: Refreshing state... [id=gotzdatacheck]
github_repository_file.iac_CODEOWNERS: Refreshing state... [id=iac/CODEOWNERS]
github_branch_protection.iac_main: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjIwNjkyMTY=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.iac has been changed
  ~ resource "github_repository" "iac" {
      ~ etag                   = "W/\"75c833fffbf85b9c010fa53670a78474ea56bb2879811f1a5a79c929c812e6ea\"" -> "W/\"f5b72a1ac101796cc5460e58a53d275c9f1e6f8a73b72ae7d467993930e31923\""
        id                     = "iac"
        name                   = "iac"
        # (26 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository_file.iac_CODEOWNERS must be replaced
-/+ resource "github_repository_file" "iac_CODEOWNERS" {
      ~ commit_author       = "Seokchan Ahn" -> (known after apply)
      ~ commit_email        = "sean9509@gmail.com" -> (known after apply)
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "9cf8d4a056249d9a4f5b2761328d862e9c045d32" -> (known after apply)
      ~ content             = <<-EOT
            *       @sean-ahn
        EOT
      ~ file                = "CODEOWNERS" -> ".github/CODEOWNERS" # forces replacement
      ~ id                  = "iac/CODEOWNERS" -> (known after apply)
      ~ sha                 = "3f70e091e96d8a1c3eb4d7960c596d7fb24d1e74" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @sean-ahn, Action: `pull_request`*